-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: 140.210.195.116    Database: wtu
-- ------------------------------------------------------
-- Server version	8.1.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `team_requirement`
--

DROP TABLE IF EXISTS `team_requirement`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `team_requirement` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT 'Primary Key',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Create Time',
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Update Time',
  `team_id` int NOT NULL COMMENT 'Team UUID',
  `type` varchar(10) NOT NULL DEFAULT 'any',
  `content` varchar(255) DEFAULT NULL,
  `is_deleted` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=115 DEFAULT CHARSET=utf8mb3 COMMENT='新建队伍时的要求表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `team_requirement`
--

LOCK TABLES `team_requirement` WRITE;
/*!40000 ALTER TABLE `team_requirement` DISABLE KEYS */;
INSERT INTO `team_requirement` VALUES (65,'2023-10-03 09:34:43','2023-10-03 09:34:43',209,'捕获数','0',0),(66,'2023-10-04 11:56:20','2023-10-04 11:56:24',223,'任意','',1),(67,'2023-10-04 19:15:01','2023-10-06 23:01:30',236,'捕获数','300',1),(68,'2023-10-04 22:13:43','2023-10-04 22:15:52',237,'任意','游戏内私我喵，谢谢喵',1),(69,'2023-10-04 22:14:39','2023-10-04 22:14:43',238,'任意','游戏内私我',1),(70,'2023-10-04 22:14:39','2023-10-04 22:14:43',238,'任意','/w cyxcmiao 1',1),(71,'2023-10-04 22:21:07','2023-10-04 22:27:41',239,'捕获数','1',1),(72,'2023-10-04 22:21:07','2023-10-04 22:27:41',239,'任意','/join cyxcmiao',1),(73,'2023-10-05 22:59:36','2023-10-06 00:10:17',244,'虚空遗物','',1),(74,'2023-10-06 00:06:30','2023-10-06 22:44:59',245,'任意','',1),(75,'2023-10-06 09:48:04','2023-10-06 09:48:04',249,'虚空遗物','古迹捕获',0),(76,'2023-10-06 13:08:32','2023-10-06 13:09:13',251,'捕获数','1000',1),(77,'2023-10-06 13:09:04','2023-10-06 13:09:29',252,'捕获数','1000',1),(78,'2023-10-06 13:22:57','2023-10-08 18:02:05',253,'任务','',1),(79,'2023-10-06 14:28:41','2023-10-06 15:33:29',254,'捕获数','1000',1),(80,'2023-10-06 14:28:41','2023-10-06 15:33:29',254,'其他','伤害水',1),(81,'2023-10-06 17:47:44','2023-10-06 17:47:44',255,'账户加成','MOD掉率',0),(82,'2023-10-06 19:47:08','2023-10-06 20:01:04',257,'任意','',1),(83,'2023-10-06 22:54:06','2023-10-06 22:54:41',260,'任务','迷雾再生剧情任务做完',1),(84,'2023-10-06 23:03:05','2023-10-08 20:37:43',279,'任务','迷雾再生剧情任务做完',1),(85,'2023-10-07 05:41:35','2023-10-07 05:41:35',317,'装备','拍手血妈',0),(86,'2023-10-08 14:22:48','2023-10-08 14:23:57',364,'任意','集团水男',1),(87,'2023-10-08 20:38:21','2023-10-15 18:32:37',365,'任务','迷雾再生剧情任务做完',1),(88,'2023-10-08 22:53:47','2023-10-08 22:53:53',369,'任意','学技术不参加啊没时间洗桑拿卡看手机手机是呐刷卡显卡吧登记下你打你洗洗不打击超级大逆袭记超级大你吃鸡鸡从哪打卡啦',1),(89,'2023-10-08 22:53:47','2023-10-08 22:53:53',369,'任意','学技术不参加啊没时间洗桑拿卡看手机手机是呐刷卡显卡吧登记下你打你洗洗不打击超级大逆袭记超级大你吃鸡鸡从哪打卡啦',1),(90,'2023-10-08 22:53:47','2023-10-08 22:53:53',369,'任意','学技术不参加啊没时间洗桑拿卡看手机手机是呐刷卡显卡吧登记下你打你洗洗不打击超级大逆袭记超级大你吃鸡鸡从哪打卡啦',1),(91,'2023-10-08 22:53:47','2023-10-08 22:53:53',369,'任意','学技术不参加啊没时间洗桑拿卡看手机手机是呐刷卡显卡吧登记下你打你洗洗不打击超级大逆袭记超级大你吃鸡鸡从哪打卡啦',1),(92,'2023-10-08 22:53:47','2023-10-08 22:53:53',369,'任意','学技术不参加啊没时间洗桑拿卡看手机手机是呐刷卡显卡吧登记下你打你洗洗不打击超级大逆袭记超级大你吃鸡鸡从哪打卡啦',1),(93,'2023-10-08 22:53:47','2023-10-08 22:53:53',369,'任意','学技术不参加啊没时间洗桑拿卡看手机手机是呐刷卡显卡吧登记下你打你洗洗不打击超级大逆袭记超级大你吃鸡鸡从哪打卡啦',1),(94,'2023-10-08 22:53:47','2023-10-08 22:53:53',369,'任意','学技术不参加啊没时间洗桑拿卡看手机手机是呐刷卡显卡吧登记下你打你洗洗不打击超级大逆袭记超级大你吃鸡鸡从哪打卡啦',1),(95,'2023-10-08 22:53:47','2023-10-08 22:53:53',369,'任意','学技术不参加啊没时间洗桑拿卡看手机手机是呐刷卡显卡吧登记下你打你洗洗不打击超级大逆袭记超级大你吃鸡鸡从哪打卡啦',1),(100,'2023-10-12 09:01:37','2023-10-12 09:01:37',380,'任务','',0),(101,'2023-10-22 19:09:31','2023-10-22 19:10:57',401,'捕获数','百捕及以上',1),(102,'2023-10-27 20:31:47','2023-10-27 23:19:26',408,'任意','',1),(103,'2023-11-03 15:44:35','2023-11-03 15:44:35',409,'虚空遗物','前K6无暇、光辉；古W3光；后W3光；或者新花核桃',0),(104,'2023-11-05 11:00:58','2023-11-05 11:02:47',411,'虚空遗物','古纪V6',1),(105,'2023-11-05 11:00:58','2023-11-05 11:02:47',411,'其他','光辉',1),(106,'2023-11-05 11:03:08','2023-11-05 11:07:14',412,'虚空遗物','古纪V6',1),(107,'2023-11-05 11:03:08','2023-11-05 11:07:14',412,'其他','光辉',1),(108,'2023-11-05 11:08:09','2023-11-05 11:16:09',413,'虚空遗物','古纪v6',1),(109,'2023-11-05 11:08:09','2023-11-05 11:16:09',413,'其他','光辉核桃',1),(110,'2023-11-05 11:08:09','2023-11-05 11:16:09',413,'任务','22轮换',1),(111,'2023-11-10 12:58:26','2023-11-10 12:58:26',416,'装备','',0),(112,'2023-11-19 09:51:32','2023-11-19 09:51:32',421,'任意','开专车有票来晚上八点半',0),(113,'2023-11-20 19:13:41','2023-11-20 19:16:54',422,'门票','双票自备',1),(114,'2023-11-20 19:16:08','2023-11-20 19:45:48',423,'其他','/join 粥粥契约 双子花 洛基磁 全蚀丑',1);
/*!40000 ALTER TABLE `team_requirement` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-12-10  9:18:57
